#задача 6 
print("Задача 6")
N = int(input("Введите число N: "))
i = 1
while i < N:
    print(i)
    i += 1

#задача 7 
print("Задача 7")
a = float(input("Введите число a: "))
i = 1
s = 0
while s <= a:
    s += 1 / i
    i += 1
    if s > a:
        print(i-1)

#задача 8
print("Задача 8")
n = int(input("Введите число n: "))
i = 1
while i * i <= n:
    i += 1
print(i)


#Задача 9
print("Задача 9")
i = 201 
while i % 17 != 0:
    i += 1
print(i)

#Задача 10
print("Задача 10")
i = 599 
while i % 28 != 0:
    i -=1 
print(i)

#Задача 11 
