num1 =23 #числовой тип данных 
num2 =42 

del num1 #удаляет переменнную num1
del num2, num3 #удаляет обе переменные num2 за num3 за раз

int #целое число
long #длинное число
float #число с точкой: -0.2, 0.0, 3.1456382 и тд
complex #комплексное число, например объединяется с буквой 

text = "Hello World"
print text[0] #выводит первый символ

my_list =[true, 786, 3.14, 'text', 70.2]
second_list =[123, 'text']

print my_list #напечатать весь список
print my_list[0] #напечатать первый элемент списка
print my_list[1:3] #напечатать элементы списка со второго по третий
print my_list[2:] #напечатать элементы списка начиная с третьего 
print second_list *2 #напечатает удвоенный список 
print my_list + second_list #напечатает объединенные списки 
